//文件名：memcpy
//作  者：ccate
//时  间：2019.1
//描  述：memcpy在两块内存之间拷贝数据（参数1：目标地址；参数2：原地址；参数3：拷贝多少内容，字节）

#include<stdio.h>
#include<string.h>

int main0009()
{
	short a[10] = {1,2,3,4,5,6,7,8,9,10};//short一个整数占2个字节
	int b[10] = { 0 };//int型一个整数占4个字节
	memcpy(b, a, sizeof(a));
	int i;
	for(i = 0;i<10;i++)
	{
		printf("%08x\n",b[i]);//%x以十六进制数格式输出整数,08补齐前面的0，为了看起来更容易理解一些
	}
	/*输出结果：由于a和b类型不一致，所以拷贝的时候会出现下列情况
	00020001
	00040003
	00060005
	00080007
	000a0009
	00000000
	00000000
	00000000
	00000000
	00000000
	*/
	return 0;
}