//文件名：poin_array
//作  者：ccate
//时  间：2018.12
//描  述：指针与数组的关系

#include<stdio.h>

int main()
{
	int a[10] = {1,2,3,4,5,6,7,8,9,10};
	int *p;
	p = a;//可以这样指向，数组的名字就代表数组第一个元素的地址,等同于 p = &a[0]
	
	int *p1;
	p1 = &a[5];//把a5的地址给指针p1
	*p1 = 1000;
	p1[2] = 666;//p1指向a[5],则p1[2]顺延指向a[7],改变的是a[7]的值，把数组想象成一个队列

	p[3] = 100;//当指针变量指向一个数组的时候，c语言语法规定指针变量名可以当数组名用，区别在哪里？
	//区别:
	printf("%lu,%lu\n", sizeof(a),sizeof(p));//对数组来讲返回数组的大小40，对指针来讲返回指针的大小4

	int i;
	for(i=0;i<10;i++)
	{
		printf("a[%d]=%d\n",i,a[i]);
		printf("a[%d]=%d\n",i,p[i]);//像数组一样使用指针
	}
	return 0;
}
/*
运算结果:
40,4
a[0]=1
a[0]=1
a[1]=2
a[1]=2
a[2]=3
a[2]=3
a[3]=100
a[3]=100
a[4]=5
a[4]=5
a[5]=1000
a[5]=1000
a[6]=7
a[6]=7
a[7]=666
a[7]=666
a[8]=9
a[8]=9
a[9]=10
a[9]=10
*/